In [1]:
import numpy as np

import pandas as pd

In [4]:
data_one = { "A" :  ["A0" , "A1" , "A2" , "A3"]   , "B" :  ["B0" , "B1" , "B2" , "B3"] }

In [6]:
data_two = { "C" :  ["C0" , "C1" , "C2" , "C3"]   , "D" : ["D0" , "D1", "D2" , "D3"]   }

one = pd.DataFrame(data_one)

two = pd.DataFrame(data_two)

In [8]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [9]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

### Concatenating both dataframes

In [10]:
pd.concat([one , two] , axis = 1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3